class Product {
  final int id, price;
  final String title, subTitle, image, description;

  Product({
    required this.id,
    required this.price,
    required this.title,
    required this.subTitle,
    required this.description,
    required this.image,
  });
}


List<Product> products = [
  Product(
    id: 1,
    price: 59,
    title: "سماعات لاسلكية",
    subTitle: "جودة صوت عالية",
    description:
        "تمتع بجودة صوت استثنائية مع سماعاتنا اللاسلكية. تتميز بتقنية البلوتوث الحديثة وميكروفون مدمج لإجراء المكالمات بوضوح. تصميم عصري ومريح للاستخدام اليومي. استمتع بتجربة صوت استثنائية مع سماعاتنا.",
    image: 'images/airpod.jpeg',
  ),
  Product(
    id: 2,
    price: 1099,
    title: "جهاز موبايل",
    subTitle: "أصبح للموبايل قوة",
    description:
        "استمتع بأحدث تقنيات الهواتف المحمولة مع جهازنا المحمول. يتميز بشاشة عالية الدقة وأداء سريع وكاميرا متطورة. يعمل بنظام التشغيل الأحدث ويوفر مساحة تخزين كبيرة لتخزين جميع بياناتك وتطبيقاتك المفضلة.",
    image: 'images/mobile.png',
  ),
  Product(
    id: 3,
    price: 39,
    title: "نظارات ثلاثية الأبعاد",
    subTitle: "لنقلك للعالم الافتراضي",
    description:
        "استمتع بتجربة رائعة للواقع الافتراضي مع نظاراتنا ثلاثية الأبعاد. استكشف عوالم جديدة واستمتع بمشاهدة الأفلام والألعاب ثلاثية الأبعاد. تصميم مريح وعصري. احصل على نظارات ثلاثية الأبعاد وانغمس في عالم الواقع الافتراضي.",
    image: 'images/class.jpeg',
  ),
  Product(
    id: 4,
    price: 56,
    title: "سماعات",
    subTitle: "لساعات استماع طويلة",
    description:
        "استمتع بجودة صوت استثنائية مع سماعاتنا عالية الأداء. تمنحك ساعات طويلة من الاستماع المريح دون توقف. تصميم عصري ومريح يوفر راحة فائقة أثناء الاستخدام. استمتع بتجربة صوتية استثنائية مع سماعاتنا عالية الجودة.",
    image: 'images/headset.jpeg',
  ),
  Product(
    id: 5,
    price: 75,
    title: "فأر",
    subTitle: "تحكم سلس ودقيق",
    description:
        "احصل على فأرة تحكم سلسة ودقيقة لجهاز الكمبيوتر الخاص بك. تصميم مريح يسمح لك بالتحكم بالفأرة بسهولة ودقة. توفر لك تجربة استخدام سلسة وفعالة في العمل والألعاب. اجعل تجربة استخدام جهاز الكمبيوتر الخاص بك أكثر سهولة وفاعلية مع فأرتنا.",
    image: 'images/mouse.png',
  ),
  Product(
    id: 6,
    price: 265,
    title: " كاميرات كمبيوتر",
    subTitle: "بجودة ودقة صورة عالية",
    description:
        "احصل على كاميرا كمبيوتر عالية الجودة والدقة لتسجيل الفيديو وإجراء مكالمات الفيديو بوضوح. توفر صوراً واضحة ونقية مع تفاصيل دقيقة. تصميم مرن يسمح لك بتوجيه الكاميرا بسهولة للحصول على زاوية الرؤية المثالية.",
    image: 'images/camera.jpeg',
  ),
];
